src/cf/src/AccumulationRegisters/Убытки/Убытки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Убытки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеРасходы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Выручка</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ВаловаяПрибыль</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/СтатьиДвиженияДенежныхСредств/СтатьиДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДвиженияДенежныхСредств</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>АвансКлиента</name>
      <description>Avance client</description>
    </items>
    <items>
      <name>ПрибыльОтПродаж</name>
      <description>Bénéfice des ventes</description>
    </items>
    <items>
      <name>НачислениеПоТабелю</name>
      <description>Paie selon la feuille de temps</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Prime</description>
    </items>
    <items>
      <name>Себестоимость</name>
      <description>Prix de revient</description>
    </items>
    <items>
      <name>ПересортицаТоваров</name>
      <description>Reclassement des marchandises</description>
    </items>
    <items>
      <name>УценкаТоваров</name>
      <description>Réductions sur les produits</description>
    </items>
    <items>
      <name>ВыемкаИзКассы</name>
      <description>Retrait de la caisse</description>
    </items>
    <items>
      <name>ВыплатаЗарплаты</name>
      <description>Salaire</description>
    </items>
    <items>
      <name>КурсовыеРазницы</name>
      <description>Écarts de change</description>
    </items>
  </predefined>
  <attributes>
    <name>ДоходыИУбытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУбытков</name>
    <type>
      <types>EnumRef.ВидыУбытков</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧХозяйственныеОперации</name>
    <attributes>
      <name>ХозяйственнаяОперация</name>
      <type>
        <types>EnumRef.ХозяйственныеОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/AccumulationRegisters/Убытки/ManagerModule.bsl
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;  
	ХО = Перечисления.ХозяйственныеОперации;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		Если ДокОбъект.Контрагент = Справочники.Контрагенты.Migration тогда Возврат; КонецЕсли;
		//Запрос = Новый Запрос("ВЫБРАТЬ
		//                      |	ТЧУслуги.Ссылка.Дата КАК Период,
		//                      |	ТЧУслуги.Ссылка.Организация КАК Организация,
		//                      |	ТЧУслуги.СтатьяДДС КАК СтатьяДДС,
		//                      |	СУММА(ТЧУслуги.СуммаСНДС) КАК Сумма
		//                      |ИЗ
		//                      |	Документ.ПоступлениеТоваровУслуг.ТЧУслуги КАК ТЧУслуги
		//                      |ГДЕ
		//                      |	ТЧУслуги.Ссылка = &Док
		//                      |	И ТЧУслуги.СтатьяДДС <> ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		//                      |
		//                      |СГРУППИРОВАТЬ ПО
		//                      |	ТЧУслуги.СтатьяДДС,
		//                      |	ТЧУслуги.Ссылка.Дата,
		//                      |	ТЧУслуги.Ссылка.Организация");
		//Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		//ДокОбъект.Движения.Убытки.Загрузить(Запрос.Выполнить().Выгрузить());
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") Тогда	
		//ТЗ = ДокОбъект.Движения.ДополнительныеРасходы.Выгрузить();
		//ТЗ.Свернуть("СтатьяДДС", "Сумма");
		//Для Каждого Стр Из ТЗ Цикл
		//	СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, Стр.СтатьяДДС, Стр.Сумма);	
		//КонецЦикла;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеТоваров") Тогда	
		//ТЗПартии = Движения.ТоварыВНаличии.Выгрузить();
		//ТЗДополнительныеРасходы = Движения.ДополнительныеРасходы.Выгрузить();
		//СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.СтатьяДДС, ТЗПартии.Итог("Сумма") + ТЗДополнительныеРасходы.Итог("Сумма"));
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПересортицаТоваров") Тогда
		//СуммаУбытков = ДокОбъект.ДополнительныеСвойства.Убытки;
		//СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, Справочники.СтатьиДвиженияДенежныхСредств.ПересортицаТоваров, СуммаУбытков);  
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Или ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда		
		Если Не ОбщегоНазначенияВызовСервераПовтИсп.ЭтоПрочееДДС(ДокОбъект.ХозяйственнаяОперация) 
			И Не ОбщегоНазначенияВызовСервераПовтИсп.ЭтоРасчётыСФизическимиЛицами(ДокОбъект.ХозяйственнаяОперация) Тогда Возврат КонецЕсли;
		Если ДокОбъект.СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ВыемкаИзКассы Тогда Возврат; КонецЕсли;
		СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.СтатьяДДС, ДокОбъект.МестоХранения, ДокОбъект.ХозяйственнаяОперация, ДокОбъект.Сумма);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.УценкаТоваров") Тогда
		//ТЗДополнительныеРасходы = Движения.ДополнительныеРасходы.Выгрузить();
		//СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.УценкаТоваров;
		//СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, СтатьяДДС, - ТЗДополнительныеРасходы.Итог("Сумма"));
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПрочиеРасходы") Тогда
		Для Каждого Стр Из ДокОбъект.ТЧРасходы Цикл
			СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, Стр.СтатьяДДС, ДокОбъект.МестоХранения, ДокОбъект.ХозяйственнаяОперация, Стр.Сумма);	
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПрочиеРасходыВозврат") Тогда
		Для Каждого Стр Из ДокОбъект.ТЧРасходы Цикл
			СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, Стр.СтатьяДДС, ДокОбъект.МестоХранения, ДокОбъект.ХозяйственнаяОперация, - Стр.Сумма);	
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

Процедура СформироватьДвижение(Движения, Период, Организация, СтатьяДДС, МестоХранения, ХозяйственнаяОперация, Сумма)
	Если Сумма = 0 Тогда Возврат КонецЕсли;
	НС = Движения.Убытки.Добавить();		
	НС.Период = Период;
	НС.Организация = Организация;
	НС.СтатьяДДС = СтатьяДДС;
	НС.ХозяйственнаяОперация = ХозяйственнаяОперация;
	НС.МестоХранения = МестоХранения;
	НС.Сумма = Сумма;	
КонецПроцедуры

Функция СформироватьТаблицуПрибылейИУбытков(Знач НачалоПериода, Знач КонецПериода) Экспорт
	НачалоПериода = ?(ЗначениеЗаполнено(НачалоПериода), НачалоПериода, Дата(2000,1,1));
	КонецПериода = ?(ЗначениеЗаполнено(КонецПериода), КонецПериода, Дата(2100,12,31));
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Месяц", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТЗ.Колонки.Добавить("Группа", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Регистратор");	
	ТЗ.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Сумма", Метаданные.ОпределяемыеТипы.Сумма.Тип);
	ТЗ.Колонки.Добавить("СуммаПрибыль", Метаданные.ОпределяемыеТипы.Сумма.Тип);
	// Получим прибыль и убытки
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПродажиОбороты.Организация КАК Организация,
	                      |	ПродажиОбороты.СебестоимостьОборот КАК Себестоимость,
	                      |	ПродажиОбороты.ВыручкаОборот КАК Выручка,
	                      |	ПродажиОбороты.ВаловаяПрибыльОборот КАК ВаловаяПрибыль,
	                      |	ПродажиОбороты.Регистратор КАК Регистратор,
	                      |	ПродажиОбороты.ПериодМесяц КАК Период
	                      |ИЗ
	                      |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ПродажиОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	УбыткиОбороты.Организация КАК Организация,
	                      |	УбыткиОбороты.СтатьяДДС.ВидУбытков КАК ВидУбытков,
	                      |	УбыткиОбороты.СтатьяДДС КАК СтатьяДДС,
	                      |	УбыткиОбороты.СуммаОборот КАК Сумма,
	                      |	УбыткиОбороты.Регистратор КАК Регистратор,
	                      |	УбыткиОбороты.ПериодМесяц КАК Период
	                      |ИЗ
	                      |	РегистрНакопления.Убытки.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК УбыткиОбороты");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Рез = Запрос.ВыполнитьПакет();	
	// Прибыль
	Выб = Рез[0].Выбрать();
	Пока Выб.Следующий() Цикл
		ДобавитьПоказатель(ТЗ, Выб.Период, Выб.Организация, "Доход", "Выручка", Выб.Регистратор, 1, Выб.Выручка);
		ДобавитьПоказатель(ТЗ, Выб.Период, Выб.Организация, "Доход", "Себестоимость", Выб.Регистратор, 2, Выб.Себестоимость);
		ДобавитьПоказатель(ТЗ, Выб.Период, Выб.Организация, "Доход", "Валовый доход", Выб.Регистратор, 3, Выб.ВаловаяПрибыль, Выб.ВаловаяПрибыль);
	КонецЦикла;
	// Убытки
	ТЗУбытки = Рез[1].Выгрузить();
	Мас = ТЗУбытки.НайтиСтроки(Новый Структура("ВидУбытков", Перечисления.ВидыУбытков.ОперационныеЗатраты));
	Для А = 1 - Мас.Количество() По 0 Цикл
		Стр = Мас[-А];
		ДобавитьПоказатель(ТЗ, Стр.Период, Стр.Организация, "Операционные затраты", СокрЛП(Стр.СтатьяДДС), Стр.Регистратор, 4, Стр.Сумма, -Стр.Сумма);
		ТЗУбытки.Удалить(Стр);
	КонецЦикла;
	// EBITDA
	ТЗИтог = ТЗ.Скопировать();
	ТЗИтог.Свернуть("Месяц, Организация", "СуммаПрибыль");
	Для Каждого Стр Из ТЗИтог Цикл
		ДобавитьПоказатель(ТЗ, Стр.Месяц, Стр.Организация, "Итог", "EBITDA", Неопределено, 10, Стр.СуммаПрибыль);	
	КонецЦикла;	
	// Получим отчисления
	Для А = 1 - ТЗУбытки.Количество() По 0 Цикл
		Стр = ТЗУбытки[-А];
		ДобавитьПоказатель(ТЗ, Стр.Период, Стр.Организация, "Отчисления", СокрЛП(Стр.СтатьяДДС), Стр.Регистратор, 6, Стр.Сумма, -Стр.Сумма);
	КонецЦикла;
	// Чистая прибыль
	ТЗИтог = ТЗ.Скопировать();
	ТЗИтог.Свернуть("Месяц, Организация", "СуммаПрибыль");
	Для Каждого Стр Из ТЗИтог Цикл
		ДобавитьПоказатель(ТЗ, Стр.Месяц, Стр.Организация, "Итог", "Чистая Прибыль", Неопределено, 10, Стр.СуммаПрибыль);	
	КонецЦикла;
	ТЗ.Колонки.Удалить("СуммаПрибыль");
	Возврат ТЗ;
КонецФункции

// Возвращает сумму затрат (оборот регистра Убытки) за период.
//
// Параметры:
//  НачалоПериода - Дата - начало периода (включительно).
//  КонецПериода - Дата - конец периода (включительно).
//  МестаХранения - Массив - места хранения (отбор в иерархии); пустой массив - без отбора.
//  Организация - СправочникСсылка.Организации, Неопределено - организация; Неопределено - без отбора.
//
// Возвращаемое значение:
//  Число - сумма затрат.
//
Функция ПолучитьЗатраты(НачалоПериода, КонецПериода, МестаХранения, Организация = Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(СУММА(УбыткиОбороты.СуммаОборот), 0) КАК Сумма
	                      |ИЗ
	                      |	РегистрНакопления.Убытки.Обороты(
	                      |			&НачалоПериода,
	                      |			&КонецПериода,
	                      |			,
	                      |			ВЫБОР
	                      |					КОГДА &МестаХраненияУказаны
	                      |						ТОГДА МестоХранения В ИЕРАРХИИ (&МестаХранения)
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ
	                      |				И ВЫБОР
	                      |					КОГДА &ОрганизацияУказана
	                      |						ТОГДА Организация = &Организация
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ) КАК УбыткиОбороты");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("МестаХранения", МестаХранения);
	Запрос.УстановитьПараметр("МестаХраненияУказаны", МестаХранения.Количество() > 0);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОрганизацияУказана", ЗначениеЗаполнено(Организация));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	КонецЕсли;
	Возврат 0;
КонецФункции

Процедура ДобавитьПоказатель(ТЗ, Дата, Организация, Группа, Показатель, Регистратор, Порядок, Сумма, СуммаПрибыль = 0)
	НС = ТЗ.Добавить();
	НС.Месяц = НачалоМесяца(Дата);
	НС.Организация = Организация;
	НС.Группа = Группа;
	НС.Показатель = Показатель;
	НС.Регистратор = Регистратор;
	НС.Порядок = Порядок;
	НС.Сумма = Сумма;
	НС.СуммаПрибыль = СуммаПрибыль;
КонецПроцедуры
